import முன்னோக்கி.பயிர்.பயிர்_பெயர்கள் as பயிர்கள்
from முன்னோக்கி.நீர்பாசனம்.மிர்கா import மிர்கா
from முன்னோக்கி.முன்னோக்கி import முன்னோக்கி
from முன்னோக்கி.வரைப்படம்.வரைப்படம் import வரையு

கோயம்புத்தூர் = இடம்(11.025414261179577, 76.96669404852157)

# கோயம்புத்தூரின் எதிர்காலத்துக்கு மக்காச்சோளம் ஒப்புமைகள் எங்கே இருக்கும்?
முன் = முன்னோக்கி()
ஒப்புமை = முன்.இடம்_ஒற்றுமை(கோயம்புத்தூர், "ssp585", பயிர்கள்.மக்காச்சோளம்)
ஒப்புமை.to_netcdf("./என்_முடிவுகள்/மக்காச்சோளம்.nc")
வரைப்படம் = வரையு(ஒப்புமை)
வரைப்படம்.savefig("./வெளியீடுகள்/மக்காச்சோளம்.jpg")

# கோயம்பத்தூரின் எதிர்காலத்துக்கு தக்காளிக்காக நீர்பாசனம் கொண்டுள்ள ஒப்புமைகள்் எங்கே இருக்கும்?
முன் = முன்னோக்கி(நீர்பாசனம்=மிர்கா())
ஒப்புமை = முன்.இடம்_ஒற்றுமை(கோயம்புத்தூர், "ssp585", பயிர்கள்.தக்காளி)
ஒப்புமை.to_netcdf("./என்_முடிவுகள்/தக்காளி.nc")
வரைப்படம் = வரையு(ஒப்புமை)
வரைப்படம்.savefig("./வெளியீடுகள்/தக்காளி.jpg")

# உலகத்தில் நெலுக்காக எந்த அளவுக்கு ஒப்புமைகள் கிடைக்கும்?
முன் = முன்னோக்கி()
ஒப்புமை = முன்.இடம்_ஒற்றுமை(உலகம், "ssp585", பயிர்கள்.நெல்)
# நீர்பாசனத்துடன்
முன் = முன்னோக்கி(நீர்பாசனம்=மிர்கா())
# நீர்பாசனத்தின் நீர் தன்மை கருத்தில் எடுத்தால்?

# மகசூல் எப்படி மாறும்?

# காலத்துடன் இன்னும் மாறுமா?
முன் = முன்னோக்கி()
ஒப்புமை2040 = முன்.இடம்_ஒற்றுமை(கோயம்புத்தூர், 2040, பயிர்கள்.மக்காச்சோளம்)
ஒப்புமை2060 = முன்.இடம்_ஒற்றுமை(கோயம்புத்தூர், 2060, பயிர்கள்.மக்காச்சோளம்)
ஒப்புமை2080 = முன்.இடம்_ஒற்றுமை(கோயம்புத்தூர், 2080, பயிர்கள்.மக்காச்சோளம்)
வரையு(ஒப்புமை2060 - ஒப்புமை2040)
வரையு(ஒப்புமை2080 - ஒப்புமை2040)
