from math import prod
from typing import Optional

import numpy as np
import xarray as xr
import xarray.testing as xrt

from முன்னோக்கி.அச்சுகள் import அகலாங்கு_அச்சு, நெட்டாங்கு_அச்சு
from முன்னோக்கி.காலநிலை.காலநிலை import காலநிலை_குறிப்பு
from முன்னோக்கி.தாள் import ஒற்றுமைக்_குறிப்பு
from முன்னோக்கி.மண்.மண் import மண்
from முன்னோக்கி.மண்.மாறிலிகள் import மண்_ஆழ_அச்சு, மண்_மாறி_அச்சு


class மண்_சுமா(மண்):
    def __init__(
        தன்,
        அகலாங்கு: Optional[np.ndarray] = None,
        நெட்டாங்கு: Optional[np.ndarray] = None,
        தரவு_கோப்புரை=None,
    ):
        super().__init__(தரவு_கோப்புரை=தரவு_கோப்புரை)

        தன்.அகலாங்கு = அகலாங்கு or np.round(np.arange(-20, 20.1, 0.1), 2)
        தன்.நெட்டாங்கு = நெட்டாங்கு or np.round(np.arange(-40, 40.1, 0.1), 2)

        தன்.மாறிகள் = ["மாறி" + str(மா) for மா in range(7)]
        தன்.மண்_ஆழம் = [0, 5, 15]

    def தரவுகளைப்_பெறு(தன், மறை: Optional[xr.DataArray] = None) -> xr.DataArray:
        ஆயக்குறூகள் = [அகலாங்கு_அச்சு, நெட்டாங்கு_அச்சு, மண்_ஆழ_அச்சு, மண்_மாறி_அச்சு]
        அளவுகள் = [தன்.அகலாங்கு.size, தன்.நெட்டாங்கு.size, len(தன்.மண்_ஆழம்), len(தன்.மாறிகள்)]
        return xr.DataArray(
            np.random.random(prod(அளவுகள்)).reshape(அளவுகள்),
            coords={
                அகலாங்கு_அச்சு: தன்.அகலாங்கு,
                நெட்டாங்கு_அச்சு: தன்.நெட்டாங்கு,
                மண்_ஆழ_அச்சு: தன்.மண்_ஆழம்,
                மண்_மாறி_அச்சு: தன்.மாறிகள்
            },
            dims=ஆயக்குறூகள்,
        )


def ஒற்றுமையைச்_சோதிக்க():
    நிலநேர்க்கோடு = 13.
    நிலநிரைக்கொடு = 15.
    குறிப்பு = ஒற்றுமைக்_குறிப்பு(காலநிலை=காலநிலை_குறிப்பு(2050))
    ஒற்றுமை = மண்_சுமா().ஒற்றுமை(
        நிலநிரைக்கொடு=நிலநிரைக்கொடு, நிலநேர்க்கோடு=நிலநேர்க்கோடு, குறிப்பு=குறிப்பு
    )
    assert ஒற்றுமை.min() == 0
    assert ஒற்றுமை.max() == 1

    xrt.assert_equal(
        ஒற்றுமை.where(ஒற்றுமை == ஒற்றுமை.max(), drop=True).coords,
        xr.Coordinates({அகலாங்கு_அச்சு: [நிலநேர்க்கோடு], நெட்டாங்கு_அச்சு: [நிலநிரைக்கொடு]}),
    )
