from abc import ABC, abstractmethod
from numbers import Number
from typing import Optional, Iterable

import xarray as xr
from xarray_regrid import Grid

from .பிழைகள் import (
    ஆதறிக்கப்பட்டாத_ஆண்டு_பிழை,
    ஆதறிக்கப்பட்டாத_காலநிலைக்காட்சி_பிழை,
    ஆதறிக்கப்பட்டாத_மாதிரி_பிழை,
)
from .மாறிலிகள் import வறலாற்று_காட்சி, காலநிலை_மாறி_அச்சு
from ..அச்சுகள் import அகலாங்கு_அச்சு, நெட்டாங்கு_அச்சு
from ..கருவிகள்.படிமுறைகள் import மஹனலோபிஸ்
from ..தாள் import தாள், ஒற்றுமைக்_குறிப்பு


class காலநிலை_குறிப்பு:
    def __init__(
        தன்,
        ஆண்டு: int | float,
        காலநிலைக்காட்சி="ssp585",
        மாதிரிகள்: Optional[str | Iterable[str]] = None,
    ):
        தன்.ஆண்டு = int(ஆண்டு)
        தன்.காலநிலைக்காட்சி = காலநிலைக்காட்சி
        தன்.மாதிரிகள் = (
            None
            if மாதிரிகள் is None
            else set([மாதிரிகள்] if isinstance(மாதிரிகள், str) else மாதிரிகள்)
        )


class சரிபார்த்த_காலநிலை_குறிப்பு(காலநிலை_குறிப்பு):
    மாதிரிகள்: set[str]

    def __init__(
        தன்,
        ஆண்டு: int | float,
        காலநிலைக்காட்சி: str,
        மாதிரிகள்: set[str],
    ):
        super().__init__(ஆண்டு=ஆண்டு, காலநிலைக்காட்சி=காலநிலைக்காட்சி, மாதிரிகள்=மாதிரிகள்)


# https://github.com/CIAT-DAPA/analogues/blob/master/R/createParameters.R
class காலநிலை(தாள், ABC):
    """ """

    @property
    @abstractmethod
    def மாதிரிகள்(தன்) -> set[str]:
        pass

    @property
    @abstractmethod
    def காட்சிகள்(தன்) -> set[str]:
        pass

    @property
    @abstractmethod
    def ஆதறிக்கப்பட்ட_ஆண்டுகள்(தன்) -> tuple[int, int]:
        pass

    @property
    @abstractmethod
    def மாறிகள்(தன்) -> set[str]:
        pass

    @abstractmethod
    def தரவுகளைப்_பெறு(தன், குறிப்பு: காலநிலை_குறிப்பு) -> xr.DataArray:
        pass

    def காலநிலை_குறிப்பு_சரிபார்த்தல்(தன், குறிப்பு: காலநிலை_குறிப்பு) -> சரிபார்த்த_காலநிலை_குறிப்பு:
        ஆண்டு = குறிப்பு.ஆண்டு
        காலநிலைக்காட்சி = குறிப்பு.காலநிலைக்காட்சி
        மாதிரிகள் = குறிப்பு.மாதிரிகள் or தன்.மாதிரிகள்

        if காலநிலைக்காட்சி == வறலாற்று_காட்சி:
            return சரிபார்த்த_காலநிலை_குறிப்பு(
                ஆண்டு=ஆண்டு, காலநிலைக்காட்சி=காலநிலைக்காட்சி, மாதிரிகள்=தன்.மாதிரிகள்
            )

        if not தன்.ஆதறிக்கப்பட்ட_ஆண்டுகள்[0] < ஆண்டு < தன்.ஆதறிக்கப்பட்ட_ஆண்டுகள்[1]:
            raise ஆதறிக்கப்பட்டாத_ஆண்டு_பிழை(ஆண்டு, கிடைக்கும்_ஆண்டுகள்=தன்.ஆதறிக்கப்பட்ட_ஆண்டுகள்)

        if காலநிலைக்காட்சி not in தன்.காட்சிகள்:
            raise ஆதறிக்கப்பட்டாத_காலநிலைக்காட்சி_பிழை(காலநிலைக்காட்சி, கிடைக்கும்_காட்சிகள்=தன்.காட்சிகள்)

        கிடைக்காத_மாதிரிகள் = [மா for மா in மாதிரிகள் if மா not in தன்.மாதிரிகள்]
        if கிடைக்காத_மாதிரிகள்:
            raise ஆதறிக்கப்பட்டாத_மாதிரி_பிழை(கிடைக்காத_மாதிரிகள், கிடைக்கும்_மாதிரிகள்=தன்.மாதிரிகள்)

        return சரிபார்த்த_காலநிலை_குறிப்பு(
            ஆண்டு=ஆண்டு, காலநிலைக்காட்சி=காலநிலைக்காட்சி, மாதிரிகள்=மாதிரிகள்
        )

    def தொலைவு(
        தன், இலக்கு_மாறிகள்: xr.DataArray, மூல்_காலநிலை_குறிப்பு: xr.DataArray
    ) -> xr.DataArray:
        # இலக்கு சூழ்நிலையில் ஒற்றுமையைக் கணக்கிடு
        கூட்டுச்சராசரி = இலக்கு_மாறிகள்.mean([அகலாங்கு_அச்சு, நெட்டாங்கு_அச்சு])
        நியமவிலகல் = இலக்கு_மாறிகள்.std([அகலாங்கு_அச்சு, நெட்டாங்கு_அச்சு])
        நெறிம்பபடுத்தப்பட்ட_இலக்கு = (இலக்கு_மாறிகள் - கூட்டுச்சராசரி) / நியமவிலகல்
        நெறிம்பபடுத்தப்பட்ட_மூல் = (மூல்_காலநிலை_குறிப்பு - கூட்டுச்சராசரி) / நியமவிலகல்

        return மஹனலோபிஸ்(
            நெறிம்பபடுத்தப்பட்ட_இலக்கு, நெறிம்பபடுத்தப்பட்ட_மூல், அச்சு=காலநிலை_மாறி_அச்சு
        )

    def ஒற்றுமை(
        தன்,
        நிலநேர்க்கோடு: Number,
        நிலநிரைக்கொடு: Number,
        குறிப்பு: ஒற்றுமைக்_குறிப்பு,
        மறை: Optional[xr.DataArray] = None,
    ) -> xr.DataArray:
        # மூல் சூழ்திலையில் வேண்டிய இடத்தைப் பெறு. ஆண்டு என்ன வேண்டாலும் போட முடியும்
        மூல்_காலநிலை_குறிப்பு = தன்.தரவுகளைப்_பெறு(
            காலநிலை_குறிப்பு(ஆண்டு=1990, காலநிலைக்காட்சி=வறலாற்று_காட்சி)
        ).regrid.linear(
            Grid(
                **{
                    அகலாங்கு_அச்சு: நிலநிரைக்கொடு,
                    நெட்டாங்கு_அச்சு: நிலநிரைக்கொடு,
                    north: 90,
                    east: 180,
                    south: 45,
                    west: 90,
                    resolution_lat: 0.17,
                    resolution_lon: 0.17,
                }
            ).create_regridding_dataset()
        )

        இலக்கு_மாறிகள் = தன்.தரவுகளைப்_பெறு(குறிப்பு.காலநிலை)

        return தன்.தொலைவு(இலக்கு_மாறிகள், மூல்_காலநிலை_குறிப்பு)
