from typing import Iterable, Tuple


class ஆதறிக்கப்பட்டாத_மாதிரி_பிழை(ValueError):
    def __init__(தன், மாதிரி: Iterable[str], கிடைக்கும்_மாதிரிகள்: Iterable[str]):
        தன்.கிடைக்காத_மாதிரி = மாதிரி
        தன்.கிடைக்கும்_மாதிரிகள் = கிடைக்கும்_மாதிரிகள்

    def __str__(தன்):
        return (
            f"இந்த காலநிலை மாதிரிகள் கிடைக்கவில்லை: {', '.join(தன்.கிடைக்காத_மாதிரி)}.\n"
            f"இவையே கிடைக்கும் மாதிரிகள் ஆகும்: {', '.join(தன்.கிடைக்கும்_மாதிரிகள்)}."
        )


class ஆதறிக்கப்பட்டாத_காலநிலைக்காட்சி_பிழை(ValueError):
    def __init__(தன், காட்சி: Iterable[str], கிடைக்கும்_காட்சிகள்: Iterable[str]):
        தன்.கிடைக்காத_காட்சி = காட்சி
        தன்.கிடைக்கும்_காட்சிகள் = கிடைக்கும்_காட்சிகள்

    def __str__(தன்):
        return (
            f"இந்த காலநிலை மாதிரிகள் கிடைக்கவில்லை: {', '.join(தன்.கிடைக்காத_காட்சி)}.\n"
            f"இவையே கிடைக்கும் மாதிரிகள் ஆகும்: {', '.join(தன்.கிடைக்கும்_காட்சிகள்)}."
        )


class ஆதறிக்கப்பட்டாத_ஆண்டு_பிழை(ValueError):
    def __init__(தன், ஆண்டு: int, கிடைக்கும்_ஆண்டுகள்: Tuple[int, int]):
        தன்.ஆண்டு = ஆண்டு
        தன்.கிடைக்கும்_ஆண்டுகள் = கிடைக்கும்_ஆண்டுகள்

    def __str__(தன்):
        return f"நீங்கள் குறிப்பிடும் ஆண்டு இந்த தேதிகளுக்குள்ளே இருக்கவும்: {'-'.join(தன்.கிடைக்கும்_ஆண்டுகள்)}."


class ஆதறிக்கப்பட்டாத_ஆயக்குறூகள்_பிழை(ValueError):
    def __str__(தன்):
        return "ஆதறிக்கப்பட்டாத அயக்குறூகள்."
