import pytest
import xarray as xr

from முன்னோக்கி.காலநிலை.காலநிலை import காலநிலை, காலநிலை_குறிப்பு
from முன்னோக்கி.காலநிலை.பிழைகள் import (
    ஆதறிக்கப்பட்டாத_ஆண்டு_பிழை,
    ஆதறிக்கப்பட்டாத_மாதிரி_பிழை,
    ஆதறிக்கப்பட்டாத_காலநிலைக்காட்சி_பிழை,
)


class சுமா_காலநிலை(காலநிலை):
    @property
    def மாதிரிகள்(தன்) -> set[str]:
        return {
            "GFDL-ESM4",
            "IPSL-CM6A-LR",
            "MPI-ESM1-2-HR",
            "MRI-ESM2-0",
            "UKESM1-0-LL",
        }

    @property
    def காட்சிகள்(தன்) -> set[str]:
        return {"ssp126", "ssp370", "ssp585"}

    @property
    def ஆதறிக்கப்பட்ட_ஆண்டுகள்(தன்) -> tuple[int, int]:
        return 1950, 2100

    @property
    def மாறிகள்(தன்) -> set[str]:
        pass

    def தரவுகளைப்_பெறு(தன், குறிப்பு: காலநிலை_குறிப்பு) -> xr.DataArray:
        pass


def ஆதறிக்கப்பட்டாத_ஆண்டு_குறிப்பு_சரிபார்த்தலைச்_சோதிக்க():
    குறிப்பு = காலநிலை_குறிப்பு(ஆண்டு=2200)
    with pytest.raises(ஆதறிக்கப்பட்டாத_ஆண்டு_பிழை):
        சுமா_காலநிலை().காலநிலை_குறிப்பு_சரிபார்த்தல்(குறிப்பு)


def ஆதறிக்கப்பட்டாத_காலநிலைக்காட்சி_குறிப்பு_சரிபார்த்தலைச்_சோதிக்க():
    குறிப்பு = காலநிலை_குறிப்பு(ஆண்டு=2050, காலநிலைக்காட்சி="ஆதறிக்கப்பட்டாதது")
    with pytest.raises(ஆதறிக்கப்பட்டாத_காலநிலைக்காட்சி_பிழை):
        சுமா_காலநிலை().காலநிலை_குறிப்பு_சரிபார்த்தல்(குறிப்பு)


def ஆதறிக்கப்பட்டாத_மாதிரி_குறிப்பு_சரிபார்த்தலைச்_சோதிக்க():
    குறிப்பு = காலநிலை_குறிப்பு(ஆண்டு=2050, மாதிரிகள்="ஆதறிக்கப்பட்டாதது")
    with pytest.raises(ஆதறிக்கப்பட்டாத_மாதிரி_பிழை):
        சுமா_காலநிலை().காலநிலை_குறிப்பு_சரிபார்த்தல்(குறிப்பு)
