import math
from functools import cache

import numpy as np
import pytest
import xarray as xr
import xarray.testing as xrt

from முன்னோக்கி.அச்சுகள் import அகலாங்கு_அச்சு, நெட்டாங்கு_அச்சு
from முன்னோக்கி.காலநிலை.காலநிலை import காலநிலை, காலநிலை_குறிப்பு
from முன்னோக்கி.காலநிலை.பிழைகள் import (
    ஆதறிக்கப்பட்டாத_ஆண்டு_பிழை,
    ஆதறிக்கப்பட்டாத_மாதிரி_பிழை,
    ஆதறிக்கப்பட்டாத_காலநிலைக்காட்சி_பிழை,
)
from முன்னோக்கி.காலநிலை.மாறிலிகள் import காலநிலை_மாதிரி_அச்சு, காலநிலை_மாறி_அச்சு, வறலாற்று_காட்சி
from முன்னோக்கி.தாள் import ஒற்றுமைக்_குறிப்பு


class சுமா_காலநிலை(காலநிலை):
    @property
    def மாதிரிகள்(தன்) -> set[str]:
        return {
            "GFDL-ESM4",
            "IPSL-CM6A-LR",
            "MPI-ESM1-2-HR",
            "MRI-ESM2-0",
            "UKESM1-0-LL",
        }

    @property
    def காட்சிகள்(தன்) -> set[str]:
        return {"ssp126", "ssp370", "ssp585"}

    @property
    def ஆதறிக்கப்பட்ட_ஆண்டுகள்(தன்) -> tuple[int, int]:
        return 1950, 2100

    @property
    def மாறிகள்(தன்) -> set[str]:
        return {"மாறி ௧", "மாறி ௨", "மாறி ௩", "மாறி ௪", "மாறி ௫"}

    @property
    def ஆயக்_கூறுகள்(தன்) -> dict[str, list[int | str]]:
        return {
            அகலாங்கு_அச்சு: [9, 10, 11, 12, 13],
            நெட்டாங்கு_அச்சு: [75, 76, 77],
            காலநிலை_மாறி_அச்சு: list(தன்.மாறிகள்),
            காலநிலை_மாதிரி_அச்சு: list(தன்.மாதிரிகள்),
        }

    @cache
    def சமவாய்ப்பு_தரவுகள்(தன்) -> np.ndarray:
        அளவு = [len(ஆய) for ஆய in தன்.ஆயக்_கூறுகள்.values()]
        return np.random.random(math.prod(அளவு)).reshape(அளவு)

    def தரவுகளைப்_பெறு(தன், குறிப்பு: காலநிலை_குறிப்பு) -> xr.DataArray:
        சரிபார்த்த_குறிப்பு = தன்.காலநிலை_குறிப்பு_சரிபார்த்தல்(குறிப்பு)
        காட்சி = சரிபார்த்த_குறிப்பு.காலநிலைக்காட்சி
        மாதிரிகள் = சரிபார்த்த_குறிப்பு.மாதிரிகள்

        ஆய_குறிப்புகள் = தன்.ஆயக்_கூறுகள்
        தரவுகள் = தன்.சமவாய்ப்பு_தரவுகள்()
        if காட்சி == வறலாற்று_காட்சி:
            ஆய_குறிப்புகள்.pop(காலநிலை_மாதிரி_அச்சு)
            # வரலாற்றின் தரவுகளுக்காக முதல் மாதிரியில் தரவுகள் எடுக்கவும்
            தரவுகள் = தரவுகள்[..., 0]
        else:
            தரவுகள் = தரவுகள்[
                ..., [ஆய_குறிப்புகள்[காலநிலை_மாதிரி_அச்சு].index(மாதிரி) for மாதிரி in மாதிரிகள்]
            ]
            ஆய_குறிப்புகள்[காலநிலை_மாதிரி_அச்சு] = list(மாதிரிகள்)

        return xr.DataArray(
            தரவுகள்,
            coords=ஆய_குறிப்புகள்,
            dims=ஆய_குறிப்புகள்.keys(),
        )


def ஆதறிக்கப்பட்டாத_ஆண்டு_குறிப்பு_சரிபார்த்தலைச்_சோதிக்க():
    குறிப்பு = காலநிலை_குறிப்பு(ஆண்டு=2200)
    with pytest.raises(ஆதறிக்கப்பட்டாத_ஆண்டு_பிழை):
        சுமா_காலநிலை().காலநிலை_குறிப்பு_சரிபார்த்தல்(குறிப்பு)


def ஆதறிக்கப்பட்டாத_காலநிலைக்காட்சி_குறிப்பு_சரிபார்த்தலைச்_சோதிக்க():
    குறிப்பு = காலநிலை_குறிப்பு(ஆண்டு=2050, காலநிலைக்காட்சி="ஆதறிக்கப்பட்டாதது")
    with pytest.raises(ஆதறிக்கப்பட்டாத_காலநிலைக்காட்சி_பிழை):
        சுமா_காலநிலை().காலநிலை_குறிப்பு_சரிபார்த்தல்(குறிப்பு)


def ஆதறிக்கப்பட்டாத_மாதிரி_குறிப்பு_சரிபார்த்தலைச்_சோதிக்க():
    குறிப்பு = காலநிலை_குறிப்பு(ஆண்டு=2050, மாதிரிகள்="ஆதறிக்கப்பட்டாதது")
    with pytest.raises(ஆதறிக்கப்பட்டாத_மாதிரி_பிழை):
        சுமா_காலநிலை().காலநிலை_குறிப்பு_சரிபார்த்தல்(குறிப்பு)


def தொலைவைச்_சோதிக்க():
    ஆயக்கூறுகள் = {
        அகலாங்கு_அச்சு: [9, 10, 11, 12, 13],
        நெட்டாங்கு_அச்சு: [75, 76, 77],
        காலநிலை_மாறி_அச்சு: ["மாறி ௧", "மாறி ௨", "மாறி ௩", "மாறி ௪", "மாறி ௫"],
        காலநிலை_மாதிரி_அச்சு: [
            "GFDL-ESM4",
            "IPSL-CM6A-LR",
            "MPI-ESM1-2-HR",
            "MRI-ESM2-0",
            "UKESM1-0-LL",
        ],
    }
    அளவு = [len(ஆய) for ஆய in ஆயக்கூறுகள்.values()]

    இலக்கு_மாறிகள் = xr.DataArray(
        np.random.random(math.prod(அளவு)).reshape(அளவு),
        coords=ஆயக்கூறுகள்,
        dims=ஆயக்கூறுகள்.keys(),
    )
    மூல்_காலநிலை_குறிப்பு = இலக்கு_மாறிகள்.sel(
        {அகலாங்கு_அச்சு: [11], நெட்டாங்கு_அச்சு: [76], காலநிலை_மாதிரி_அச்சு: ["GFDL-ESM4"]}
    ).squeeze(காலநிலை_மாதிரி_அச்சு, drop=True)
    தொலைவு = சுமா_காலநிலை().தொலைவு(இலக்கு_மாறிகள், மூல்_காலநிலை_குறிப்பு)

    xrt.assert_equal(
        தொலைவு.where(தொலைவு == தொலைவு.min(), drop=True).coords,
        xr.Coordinates(
            {அகலாங்கு_அச்சு: [11], நெட்டாங்கு_அச்சு: [76], காலநிலை_மாதிரி_அச்சு: ["GFDL-ESM4"]}
        ),
    )


def ஒற்றுமையைச்_சோதிக்க():
    குறிப்பு = ஒற்றுமைக்_குறிப்பு(காலநிலை=காலநிலை_குறிப்பு(ஆண்டு=2050))
    ஒற்றுமை = சுமா_காலநிலை().ஒற்றுமை(11.016806, 76.955806, குறிப்பு)

    முதல்_மாதிரி = list(சுமா_காலநிலை().மாதிரிகள்)[0]
    xrt.assert_equal(
        ஒற்றுமை.where(ஒற்றுமை == ஒற்றுமை.max(), drop=True).coords,
        xr.Coordinates(
            {அகலாங்கு_அச்சு: [11], நெட்டாங்கு_அச்சு: [77], காலநிலை_மாதிரி_அச்சு: [முதல்_மாதிரி]}
        ),
    )
