import math

import numpy as np
import pytest
import xarray as xr
import xarray.testing as xrt

from முன்னோக்கி.அச்சுகள் import நெட்டாங்கு_அச்சு, அகலாங்கு_அச்சு
from முன்னோக்கி.காலநிலை.மாறிலிகள் import காலநிலை_மாறி_அச்சு, காலநிலை_மாதிரி_அச்சு
from முன்னோக்கி.காலநிலை.காலநிலை import காலநிலை, காலநிலை_குறிப்பு
from முன்னோக்கி.காலநிலை.பிழைகள் import (
    ஆதறிக்கப்பட்டாத_மாதிரி_பிழை,
    ஆதறிக்கப்பட்டாத_ஆண்டு_பிழை,
    ஆதறிக்கப்பட்டாத_காலநிலைக்காட்சி_பிழை,
)


class சுமா_காலநிலை(காலநிலை):
    def __init__(தன்):
        தன்.அகலாங்கு = np.arange(-180, 180)
        தன்.நெட்டாங்கு = np.arange(-90, 90)

    @property
    def மாதிரிகள்(தன்):
        return ["மாதிரி 1", "மாதிரி 2", "மாதிரி 3"]

    @property
    def காட்சிகள்(தன்):
        return ["பரவாயில்லை", "சூடது", "ரொம்பு சூடது"]

    @property
    def ஆதறிக்கப்பட்ட_ஆண்டுகள்(தன்):
        return 2021, 2100

    @property
    def மாறிகள்(தன்):
        return ["மாறி 1", "மாறி 2"]

    def தரவுகளைப்_பெறு(தன், குறிப்பு):
        சரிபார்த்த_குறிப்பு = தன்.காலநிலை_குறிப்பு_சரிபார்த்தல்(குறிப்பு)
        ஆயக்கூறுகள் = {
            அகலாங்கு_அச்சு: தன்.அகலாங்கு,
            நெட்டாங்கு_அச்சு: தன்.நெட்டாங்கு,
            காலநிலை_மாதிரி_அச்சு: சரிபார்த்த_குறிப்பு.மாதிரி,
            காலநிலை_மாறி_அச்சு: தன்.மாறிகள்,
        }
        அளவு = list(len(ஆ) for ஆ in ஆயக்கூறுகள்.values())
        return xr.DataArray(
            data=np.random.rand(math.prod(அளவு)).reshape(அளவு),
            coords=ஆயக்கூறுகள்,
            dims=[
                அகலாங்கு_அச்சு,
                நெட்டாங்கு_அச்சு,
                காலநிலை_மாதிரி_அச்சு,
                காலநிலை_மாறி_அச்சு,
            ],
        )


def test_மாதிரி_குறிப்பு_இல்லாமல்():
    குறிப்பு = காலநிலை_குறிப்பு(2040, "சூடது")
    தரவுகள் = சுமா_காலநிலை().தரவுகளைப்_பெறு(குறிப்பு)

    xrt.assert_equal(
        தரவுகள்.coords,
        xr.DataArray(
            dims=[
                அகலாங்கு_அச்சு,
                நெட்டாங்கு_அச்சு,
                காலநிலை_மாதிரி_அச்சு,
                காலநிலை_மாறி_அச்சு,
            ],
            coords={
                அகலாங்கு_அச்சு: range(-180, 180),
                நெட்டாங்கு_அச்சு: range(-90, 90),
                காலநிலை_மாதிரி_அச்சு: ["மாதிரி 1", "மாதிரி 2", "மாதிரி 3"],
                காலநிலை_மாறி_அச்சு: ["மாறி 1", "மாறி 2"],
            },
        ).coords,
    )


def test_உரை_மாதிரி_குறிப்பு():
    குறிப்பு = காலநிலை_குறிப்பு(2040, "சூடது", மாதிரி="மாதிரி 2")
    தரவுகள் = சுமா_காலநிலை().தரவுகளைப்_பெறு(குறிப்பு)
    xrt.assert_equal(
        தரவுகள்.coords,
        xr.DataArray(
            dims=[
                அகலாங்கு_அச்சு,
                நெட்டாங்கு_அச்சு,
                காலநிலை_மாதிரி_அச்சு,
                காலநிலை_மாறி_அச்சு,
            ],
            coords={
                அகலாங்கு_அச்சு: np.arange(-180, 180),
                நெட்டாங்கு_அச்சு: np.arange(-90, 90),
                காலநிலை_மாதிரி_அச்சு: ["மாதிரி 2"],
                காலநிலை_மாறி_அச்சு: ["மாறி 1", "மாறி 2"],
            },
        ).coords,
    )


def test_பட்டியல்_மாதிரி_குறிப்பு():
    குறிப்பு = காலநிலை_குறிப்பு(2040, "சூடது", மாதிரி=["மாதிரி 1", "மாதிரி 3"])
    தரவுகள் = சுமா_காலநிலை().தரவுகளைப்_பெறு(குறிப்பு)

    xrt.assert_equal(
        தரவுகள்.coords,
        xr.DataArray(
            dims=[அகலாங்கு_அச்சு, நெட்டாங்கு_அச்சு, காலநிலை_மாதிரி_அச்சு, காலநிலை_மாறி_அச்சு],
            coords={
                அகலாங்கு_அச்சு: np.arange(-180, 180),
                நெட்டாங்கு_அச்சு: np.arange(-90, 90),
                காலநிலை_மாதிரி_அச்சு: ["மாதிரி 1", "மாதிரி 3"],
                காலநிலை_மாறி_அச்சு: ["மாறி 1", "மாறி 2"],
            },
        ).coords,
    )


def test_கிடைக்காத_மாதிரி():
    குறிப்பு = காலநிலை_குறிப்பு(2040, "சூடது", மாதிரி="நான் கிடையாது")
    with pytest.raises(ஆதறிக்கப்பட்டாத_மாதிரி_பிழை):
        சுமா_காலநிலை().தரவுகளைப்_பெறு(குறிப்பு)


def test_கிடைக்காத_காட்சி():
    குறிப்பு = காலநிலை_குறிப்பு(2040, காலநிலைக்காட்சி="நான் கிடைக்காது", மாதிரி="மாதிரி 1")
    with pytest.raises(ஆதறிக்கப்பட்டாத_காலநிலைக்காட்சி_பிழை):
        சுமா_காலநிலை().தரவுகளைப்_பெறு(குறிப்பு)


def test_ஆதறிக்கப்பட்டாத_ஆண்டு():
    குறிப்பு = காலநிலை_குறிப்பு(1950, காலநிலைக்காட்சி="சூடது", மாதிரி="மாதிரி 1")
    with pytest.raises(ஆதறிக்கப்பட்டாத_ஆண்டு_பிழை):
        சுமா_காலநிலை().தரவுகளைப்_பெறு(குறிப்பு)
