class இடம்:

    def நாடுகள்(தன்) -> list[str]:
        pass


class ஆசியா(இடம்):
    def நாடுகள்(தன்) -> list[str]:
        return [
            "ஆப்கானிசுத்தான்",
            "அர்மீனியா",
            "அசர்பைசான்",
            "பகுரைன்",
            "வங்காளதேசம்",
            "பூட்டான்",
            "புரூணை",
            "கம்போடியா",
            "சீன",
            "சைப்பிரசு",
            "சியார்சியா",
            "பாரதம்",
            "பலத்தீன்",
            "இந்தோனேசியா",
            "ஈரான்",
            "ஈராக்",
            "இசுரேல்",
            "சப்பான்",
            "சோர்தான்",
            "கசகிசுதான்",
            "வடகொரியா",
            "தென் கொரியா",
            "குவைத்",
            "கிர்கிசுத்தான்",
            "லாவோஸ்",
            "லெபனான்",
            "மலேசியா",
            "மாலைத்தீவுகள்",
            "மங்கோலியா",
            "மியான்மர்",
            "நேபாளம்",
            "ஓமான்",
            "பாக்கிசுத்தான்",
            "பிலிப்பீன்சு",
            "கத்தார்",
            "ரசியா",
            "சவூதி அரேபியா",
            "சிங்கப்பூர்",
            "இலங்கை",
            "சிரியா",
            "தச்சிகிஸ்தான்",
            "தாய்லாந்து",
            "கிழக்குத் திமோர்",
            "துருக்கி",
            "துருக்மெனிசுதான்",
            "ஐக்கிய அரபு அமீரகம்",
            "உசுபெக்கிசுத்தான்",
            "வியட்நாம்",
            "யெமன்"
        ]