from முன்னோக்கி.காலநிலை.காலநிலை import காலநிலை_குறிப்பு
from முன்னோக்கி.தாள் import ஒற்றுமைக்_குறிப்பு
from முன்னோக்கி.முன்னோக்கி import முன்னோக்கி
from முன்னோக்கி.பயிர்.பயிர்_பெயர்கள் import தக்காளி
from முன்னோக்கி.வரைப்படம்.வரைப்படம் import வரையு

மாதிரி = முன்னோக்கி()
கோயம்புத்தூர் = {
    "நிலநேர்க்கோடு": 11.016806,
    "நிலநிரைக்கொடு": 76.955806,
}
குறிப்பு = ஒற்றுமைக்_குறிப்பு(காலநிலை=காலநிலை_குறிப்பு(ஆண்டு=2050), பயிர்கள்=தக்காளி)
ஒற்றுமை = மாதிரி.ஒற்றுமை(குறிப்பு=குறிப்பு, **கோயம்புத்தூர்)

வரையு(ஒற்றுமை["ஒற்றுமை"])
