import os.path
from numbers import Number
from typing import Literal, Iterable

import xarray as xr

from src.கருவிகள்.பதிவிறக்கம் import பதிவிறக்கம், ஜிப்_பதிவிறக்கம்
from src.காலநிலை.காலநிலை import காலநிலை

கிடைக்கும்_மாதிரிகள் = Literal[
    "ACCESS-CM2",
    "BCC-CSM2-MR",
    "CMCC-ESM2",
    "EC-Earth3-Veg",
    "FIO-ESM-2-0",
    "GFDL-ESM4",
    "GISS-E2-1-G",
    "HadGEM3-GC31-LL",
    "INM-CM5-0",
    "IPSL-CM6A-LR",
    "MIROC6",
    "MPI-ESM1-2-HR",
    "MRI-ESM2-0	tn",
    "UKESM1-0-LL",
]

சூழ்நிலைக்காட்சிகள் = Literal["ssp126", "ssp245", "ssp370", "ssp585"]
கிடைக்கும்_துல்லியங்கள் = Literal["30s", "2.5m", "5m", "10m"]


class சூழ்நிலை_குறிப்பு:
    def __init__(
        தன்,
        ஆண்டு: int or float,
        சூழ்நிலைக்காட்சி: சூழ்நிலைக்காட்சிகள் = "ssp585",
        மாதிரி: கிடைக்கும்_மாதிரிகள் or Iterable[கிடைக்கும்_மாதிரிகள்] = கிடைக்கும்_மாதிரிகள்,
    ):
        தன்.சூழ்நிலைக்காட்சி = சூழ்நிலைக்காட்சி
        தன்.மாதிரி = மாதிரி if isinstance(மாதிரி, str) else [மாதிரி]
        தன்.ஆண்டு = ஆண்டு


class உயிரிவானிலை(காலநிலை):
    def __init__(
        தன்,
        மூல்_சூழ்நிலை: சூழ்நிலை_குறிப்பு,
        இலக்கு_சூழ்நிலை: சூழ்நிலை_குறிப்பு,
        துல்லியம்: கிடைக்கும்_துல்லியங்கள் = "30s",
    ):
        தன்.மூல்_சூழ்நிலை = மூல்_சூழ்நிலை
        தன்.இலக்கு_சூழ்நிலை = இலக்கு_சூழ்நிலை
        தன்.துல்லியம் = துல்லியம்

    def ஒற்றுமை(தன், நிலநேர்க்கோடு: Number, நிலநிரைக்கொடு: Number) -> xr.DataArray:
        # மூல் சூழ்திலையில் வேண்டிய இடத்தைப் பெறு
        மூல்_காலநிலை_குறிப்பு =
        # மாறிகளைப் பெறு
        # இலக்கு சூழ்நிலையில் ஒற்றுமையைக் கணக்கிடு
        mu = இலக்கு_மாறிகள்.mean(["lat", "lon"])
        sigma = இலக்கு_மாறிகள்.std(["lat", "lon"])
        cible_normalisée = (இலக்கு_மாறிகள் - mu) / sigma
        origine_normalisée = (மூல்_மாறிகள்ள் - mu) / sigma

        return distance(origine_normalisée, cible_normalisée)

    def வறலாற்று_பதிவிறக்கத்தைப்_பெறு(தன்):
        முகவரி = f"https://geodata.ucdavis.edu/climate/worldclim/2_1/base/wc2.1_{தன்.துல்லியம்}_bio.zip"
        ப = ஜிப்_பதிவிறக்கம்(பெயர், பதிவிறக்க_முகவரி=முகவரி)
        ப.பெறு()
    def பதிவிறக்க_முகவரியைப்_பெறு(தன், சூழ்நிலை: சூழ்நிலை_குறிப்பு) -> Iterable[str]:
        இடைவெளிகள் = [(2021, 2040), (2041, 2060), (2061, 2080), (2081, 2100)]
        try:
            ஆண்டுகள் = next(
                இடைவெளி
                for இடைவெளி in இடைவெளிகள்
                if இடைவெளி[0] <= சூழ்நிலை.ஆண்டு <= இடைவெளி[1]
            )
        except StopIteration:
            raise ValueError(
                f"{சூழ்நிலை.ஆண்டு} என்று ஆண்டு இந்த மாதிரியால் ஆதறவிக்கப்பட்ட தேதிகளுக்கு வெளியே உள்ளது."
            )

        for மாதிரி in சூழ்நிலை.மாதிரி:
            if (
                மாதிரி == "GFDL-ESM4" and சூழ்நிலை.சூழ்நிலைக்காட்சி in ["ssp245", "ssp585"]
            ) or (
                மாதிரி in ["FIO-ESM-2-0", "HadGEM3-GC31-LL"]
                and சூழ்நிலை.சூழ்நிலைக்காட்சி == "ssp370"
            ):
                # இந்த தகவல்கள் கிடைக்காது - https://www.worldclim.org/data/cmip6/cmip6_clim30s.html
                continue

            yield f"https://geodata.ucdavis.edu/cmip6/{தன்.துல்லியம்}/{மாதிரி}/{சூழ்நிலை.சூழ்நிலைக்காட்சி}/wc2.1_{தன்.துல்லியம்}_bioc_{மாதிரி}_{சூழ்நிலை.சூழ்நிலைக்காட்சி}_{ஆண்டுகள்[0]}-{ஆண்டுகள்[1]}.tif"
