from typing import Optional

import xarray as xr
import xarray.testing as xrt

from முன்னோக்கி.அச்சுகள் import அகலாங்கு_அச்சு, நெட்டாங்கு_அச்சு
from முன்னோக்கி.காலநிலை.காலநிலை import காலநிலை_குறிப்பு
from முன்னோக்கி.தாள் import ஒற்றுமைக்_குறிப்பு
from முன்னோக்கி.பயிர்.பயிர்_பெயர்கள் import தக்காளி, தென்னை, கத்தரிக்காய், அரத்திப்பழம்
from முன்னோக்கி.பயிர்.பரப்பளவு.பயிர்_பரப்பளவு import பயிர்_பரப்பளவு
from முன்னோக்கி.பயிர்.மாறிலிகள் import பயிர்_அச்சு

ஆயக்கூறுகள் = {
    அகலாங்கு_அச்சு: [10, 11, 12],
    நெட்டாங்கு_அச்சு: [76, 77, 78],
    பயிர்_அச்சு: [தென்னை, தக்காளி, கத்தரிக்காய், அரத்திப்பழம்],
}

கோயம்புத்தூர் = {
    அகலாங்கு_அச்சு: 11.016806,
    நெட்டாங்கு_அச்சு: 76.955806,
}


class சுமா_பயிர்_பரப்பளவு(பயிர்_பரப்பளவு):
    def தரவுகளைப்_பெறு(தன், பயிர்கள்: Optional[str | list[str]] = None) -> xr.DataArray:

        return xr.DataArray(
            [
                [[1, 1, 1, 0], [1, 1, 1, 1], [1, 1, 1, 0]],
                [[0, 1, 1, 0], [1, 1, 1, 0], [1, 1, 1, 0]],
                [[1, 1, 1, 0], [0, 1, 1, 0], [1, 1, 1, 0]],
            ],
            dims=ஆயக்கூறுகள்.keys(),
            coords=ஆயக்கூறுகள்,
        )


def இருக்கும்_பயிர்களைச்_சோதிக்க():
    பயிர்கள் = சுமா_பயிர்_பரப்பளவு().இருக்கும்_பயிர்கள்(அகலாங்கு=11, நெட்டாங்கு=77)
    assert பயிர்கள் == {தென்னை, தக்காளி, கத்தரிக்காய்}


def இடைக்கணிப்புடன்_இருக்கும்_பயிர்களைச்_சோதிக்க():
    பயிர்கள் = சுமா_பயிர்_பரப்பளவு().இருக்கும்_பயிர்கள்(**கோயம்புத்தூர்)
    assert பயிர்கள் == {தென்னை, தக்காளி, கத்தரிக்காய்}


def ஒற்றுமையைச்_சோதிக்க():
    ஒற்றுமை = சுமா_பயிர்_பரப்பளவு().ஒற்றுமை(
        11.016806, 76.955806, குறிப்பு=ஒற்றுமைக்_குறிப்பு(காலநிலை=காலநிலை_குறிப்பு(2050))
    )

    ஒற்றுமை_ஆயக்கூறுகள் = {
        **ஆயக்கூறுகள்,
        பயிர்_அச்சு: [தென்னை, தக்காளி, கத்தரிக்காய்],
    }

    xrt.assert_equal(
        ஒற்றுமை.coords,
        xr.DataArray(
            0,
            coords=ஒற்றுமை_ஆயக்கூறுகள்,
            dims=ஒற்றுமை_ஆயக்கூறுகள்.keys(),
        ).coords,
    )
    assert ஒற்றுமை.min() == 0
    assert ஒற்றுமை.max() == 1
    xrt.assert_equal(
        ஒற்றுமை.sel({அகலாங்கு_அச்சு: 11, நெட்டாங்கு_அச்சு: 77}).drop_vars(கோயம்புத்தூர்.keys()),
        xr.DataArray(
            [1, 1, 1],
            coords={
                பயிர்_அச்சு: ஒற்றுமை_ஆயக்கூறுகள்[பயிர்_அச்சு],
            },
            dims=[பயிர்_அச்சு],
        ),
    )
