from numbers import Number
from typing import Optional

import xarray as xr

from .கருவிகள்.பதிவிறக்கம் import இயல்பு_தரவு_பாதை
from .காலநிலை.செல்ஸா import செல்ஸா_உயிரிகாலநிலை
from .தாள் import ஒற்றுமை_குறிப்பு, தாள்
from .நீர்பாசனம்.மிர்கா import மிர்கா
from .பயிர்.பரப்பளவு.பயிர்கட்டம் import பயிர்கட்டம்
from .பயிர்.மகசூல்.காயெஸ்கூட்டல் import காயெஸ்கூட்டல்
from .மண்.மண்கட்டம் import மண்கட்டம்


class முன்னோக்கி:
    def __init__(
        தன்,
        தாள்கள்: Optional[list[தாள்]] = None,
        செயலி_பெயர்="முன்னோக்கி",
        தரவு_கோப்புரை: Optional[str] = None,
    ):
        தன்.செயலி_பெயர் = செயலி_பெயர்
        if தரவு_கோப்புரை:
            தன்.தரவு_கோப்புரை = தரவு_கோப்புரை
        else:
            தன்.தரவு_கோப்புரை = str(இயல்பு_தரவு_பாதை(தன்.செயலி_பெயர்))

        தன்.தாள்கள் = தாள்கள் or [
            பயிர்கட்டம்(தரவு_கோப்புரை=தன்.தரவு_கோப்புரை),
            செல்ஸா_உயிரிகாலநிலை(தரவு_கோப்புரை=தன்.தரவு_கோப்புரை),
            மண்கட்டம்(தரவு_கோப்புரை=தன்.தரவு_கோப்புரை),
            மிர்கா(தரவு_கோப்புரை=தன்.தரவு_கோப்புரை),
            காயெஸ்கூட்டல்(தரவு_கோப்புரை=தன்.தரவு_கோப்புரை),
        ]

    def இடம்_ஒற்றுமை(
        தன்,
        நிலநேர்க்கோடு: Number,
        நிலநிரைக்கொடு: Number,
        குறிப்பு: ஒற்றுமை_குறிப்பு,
    ) -> xr.DataArray:
        ஒற்றுமை = xr.DataArray(1)
        for தாள்_ in தன்.தாள்கள்:
            தாள்_ஒற்றுமை = தாள்_.ஒற்றுமை(
                நிலநேர்க்கோடு=நிலநேர்க்கோடு,
                நிலநிரைக்கொடு=நிலநிரைக்கொடு,
                குறிப்பு=குறிப்பு,
                மறை=ஒற்றுமை,
            )
            ஒற்றுமை *= தாள்_ஒற்றுமை

        return ஒற்றுமை

    def பயிர்_ஒற்றுமை(தன், பயிர்: str) -> xr.DataArray:
        raise NotImplementedError

    def மேற்கோள்கள்(தன்):
        return [மேற்கோள் for தாள்_ in தன்.தாள்கள் for மேற்கோள் in தாள்_.மேற்கோள்()]

    def உரிமங்கள்(தன்):
        return [உரி for தாள்_ in தன்.தாள்கள் if (உரி := தாள்_.உரிமம்())]
