from typing import Optional, Iterable

import xarray as xr

from .காலநிலை.உயிரிகாலநிலை import காலநிலை_குறிப்பு, உயிரிகாலநிலை
from .தாள் import கூட்டுத்தாள்
from .நீர்பாசனம்.நீர்பாசனம் import நீர்பாசனம் as நீர்பாசனம்_வகை
from .நீர்பாசனம்.மிர்கா import மிர்கா
from .பயிர்.பரப்பளவு.பயிர்_பரப்பளவு import பயிர்_பரப்பளவு
from .பயிர்.பரப்பளவு.பயிர்கட்டம் import பயிர்கட்டம்
from .மண்.WISE import WISE
from .மண்.மண் import மண் as மண்_வகை


class முன்னோக்கி:
    def __init__(
        தன்,
        பயிர்: Optional[பயிர்_பரப்பளவு] = None,
        காலநிலை: Optional[காலநிலை] = உயிரிகாலநிலை(),
        மண்: Optional[மண்_வகை or list[மண்_வகை]] = WISE(),
        நீர்பாசனம்: Optional[நீர்பாசனம்_வகை or list[நீர்பாசனம்_வகை]] = மிர்கா(),
        மகசூல்: Optional[மகசூல் or Iterable[மகசூல்]] = None,
    ):
        தன்.பயிர் = பயிர் or பயிர்கட்டம்()
        தன்.காலநிலை = காலநிலை or உயிரிகாலநிலை()
        தன்.மண் = கூட்டுத்தாள்(மண்) if isinstance(மண், list) else மண்
        தன்.நீர்பாசனம் = கூட்டுத்தாள்(நீர்பாசனம்) if isinstance(நீர்பாசனம், list) else நீர்பாசனம்

        தன்.மகசூல் = மகசூல் or None

    def இடம்_ஒற்றுமை(
        தன், இடம், காலநிலை: காலநிலை_குறிப்பு, பயிர்: Optional[str or Iterable[str]] = None
    ) -> xr.DataArray:
        பயிர் = (
            [பயிர்] if isinstance(பயிர், str) else (பயிர் or தன்.பயிர்.இருக்கும்_பயிர்கள்(இடம்))
        )
        காலநிலை_ஒற்றுமை = தன்.காலநிலை.ஒற்றுமை(காலநிலை=காலநிலை, இடம்=இடம்)
        பயிர்_ஒற்றுமை = தன்.பயிர்.ஒற்றுமை(பயிர், இடம்=இடம்)
        மண்_ஒற்றுமை = தன்.மண்.ஒற்றுமை(இடம்=இடம்)
        நீர்பாசன_ஒற்றுமை = தன்.நீர்பாசனம்.ஒற்றுமை(இடம்=இடம்)

        return தன்.ஒற்றுமைகளைச்_சேரு([காலநிலை_ஒற்றுமை, மண்_ஒற்றுமை, பயிர்_ஒற்றுமை, நீர்பாசன_ஒற்றுமை])

    def பயிர்_ஒற்றுமை(தன், பயிர்: str) -> xr.DataArray:
        raise NotImplementedError

    @staticmethod
    def ஒற்றுமைகளைச்_சேரு(ஒற்றுமைகள்: Iterable[xr.DataArray]) -> xr.DataArray:
        return xr.concat(ஒற்றுமைகள், "தாள்").prod("தாள்")
