from numbers import Number
from typing import Optional, Iterable

import xarray as xr

from .கருவிகள்.பதிவிறக்கம் import இயல்பு_தரவு_பாதை
from .காலநிலை.காலநிலை import காலநிலை, காலநிலை_குறிப்பு
from .காலநிலை.செல்ஸா import செல்ஸா_உயிரிகாலநிலை
from .தாள் import ஒற்றுமை_குறிப்பு
from .நீர்பாசனம்.நீர்பாசனம் import நீர்பாசனம் as நீர்பாசனம்_வகை
from .நீர்பாசனம்.மிர்கா import மிர்கா
from .பயிர்.பரப்பளவு.பயிர்_பரப்பளவு import பயிர்_பரப்பளவு
from .பயிர்.பரப்பளவு.பயிர்கட்டம் import பயிர்கட்டம்
from .மண்.மண் import மண் as மண்_வகை
from .மண்.மண்கட்டம் import மண்கட்டம்


class முன்னோக்கி:
    def __init__(
        தன்,
        பயிர்: Optional[பயிர்_பரப்பளவு] = None,
        காலநிலை: Optional[காலநிலை] = None,
        மண்: Optional[மண்_வகை] = None,
        நீர்பாசனம்: Optional[நீர்பாசனம்_வகை] = மிர்கா(),
        மகசூல்: Optional[மகசூல்] = None,
        செயலி_பெயர்="முன்னோக்கி",
        தரவு_கோப்புரை: Optional[str] = None,
    ):
        தன்._பயிர் = பயிர் or பயிர்கட்டம்()
        தன்.காலநிலை = காலநிலை or செல்ஸா_உயிரிகாலநிலை()
        தன்.மண் = மண் or மண்கட்டம்()
        தன்.நீர்பாசனம் = நீர்பாசனம்
        தன்.மகசூல் = மகசூல்

        தன்.செயலி_பெயர் = செயலி_பெயர்
        if தரவு_கோப்புரை:
            தன்.தரவு_கோப்புரை = தரவு_கோப்புரை
        else:
            தன்.தரவு_கோப்புரை = இயல்பு_தரவு_பாதை(தன்.செயலி_பெயர்)

    def இடம்_ஒற்றுமை(
        தன்,
        நிலநேர்க்கோடு: Number,
        நிலநிரைக்கொடு: Number,
        குறிப்பு: ஒற்றுமை_குறிப்பு,
    ) -> xr.DataArray:
        பயிர்_ஒற்றுமை = தன்._பயிர்.ஒற்றுமை(
            நிலநேர்க்கோடு=நிலநேர்க்கோடு, நிலநிரைக்கொடு=நிலநிரைக்கொடு, குறிப்பு=குறிப்பு
        )

        காலநிலை_ஒற்றுமை = தன்.காலநிலை.ஒற்றுமை(
            நிலநேர்க்கோடு=நிலநேர்க்கோடு, நிலநிரைக்கொடு=நிலநிரைக்கொடு, குறிப்பு=குறிப்பு
        )

        if தன்.மண்:
            மண்_ஒற்றுமை = தன்.மண்.ஒற்றுமை(
                நிலநிரைக்கொடு=நிலநிரைக்கொடு,
                நிலநேர்க்கோடு=நிலநேர்க்கோடு,
                மறை=பயிர்_ஒற்றுமை * காலநிலை_ஒற்றுமை,
            )
        நீர்பாசன_ஒற்றுமை = தன்.நீர்பாசனம்.ஒற்றுமை(
            நிலநிரைக்கொடு=நிலநிரைக்கொடு, நிலநேர்க்கோடு=நிலநேர்க்கோடு
        )

        return தன்.ஒற்றுமைகளைச்_சேரு([காலநிலை_ஒற்றுமை, மண்_ஒற்றுமை, பயிர்_ஒற்றுமை, நீர்பாசன_ஒற்றுமை])

    def பயிர்_ஒற்றுமை(தன், பயிர்: str) -> xr.DataArray:
        raise NotImplementedError

    def மேற்கோள்கள்(தன்):
        return [மேற்கோள் for தாள் in தன்.தாள்கள் for மேற்கோள் in தாள்.மேற்கோள்]

    def உரிமங்கள்(தன்):
        return [தாள்.உரிமம் for தாள் in தன்.தாள்கள்]

    @staticmethod
    def ஒற்றுமைகளைச்_சேரு(ஒற்றுமைகள்: Iterable[xr.DataArray]) -> xr.DataArray:
        return xr.concat(ஒற்றுமைகள், "தாள்").prod("தாள்")
